/*
Мінімум

1.1 Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...), передбач можливість введення невірних даних.
1.2 Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).
1.3 Підрахуй суму всіх чисел в заданому користувачем діапазоні.
1.4 Запитай у користувача 2 числа і знайди найбільший спільний дільник.
1.5 Запитай у користувача число і виведи всі дільники цього числа.


Норма

2.1 Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.
2.2 Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
  від 200 до 300 - знижка буде 3%; 
  від 300 до 500 - 5%;
  від 500 і вище - 7%.
2.3 Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. 	При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран.Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.
2.4 Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.


Максимум

3.1 Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?». Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50. Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100. І так до тих пір, поки користувач не вибере == N (буде корисним почитати про алгоритм: "бінарний пошук").
3.2 Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.
3.3 Запитай дату (день, місяць, рік) і виведи наступну за нею дату. Враховуй можливість переходу на наступний місяць, рік, а також високосний рік.

*/

// 1.1
function stageAge(age = prompt("Напиши свій вік")) {
	console.log("1 " + +age);
	console.log("2 " + age);
	if (age === null) {
		alert("Чекаю наступного разу");
	} else if (+age < 0 || +age > 110 || isNaN(+age)) {
		alert("Введи корректний вік");
		stageAge();
	} else if (+age >= 0 && +age <= 11) {
		alert("Вітаю ти ще дитина");
	} else if (+age > 11 && age <= 17) {
		alert("Ти підліток");
	} else if (+age > 17 && +age <= 59) {
		alert("Ти дорослий");
	} else if (+age > 60) {
		alert("Ти пенсіонер");
	}
}

// 1.2

function symbolArray(index = prompt("Введи число від 0 до 9")) {
	symbolsList = [")", "!", "@", "#", "$", "%", "^", "&", "*", "("];
	if (+index > 9 || +index < 0 || isNaN(+index)) {
		alert("Невірне число введи число від 0 до 9");
	} else {
		alert(symbolsList[+index]);
	}
}

// 1.3

function sumNum(
	from = prompt("Введи число від якого треба рахувати"),
	to = prompt("А тепер число до якого треба рахувати"),
) {
	let sum = 0;
	for (let i = +from; i <= to; i++) {
		console.log(typeof i);
		sum += i;
		console.log(sum);
	}
	return alert(sum);
}

// 1.4

function findNod(
	a = parseInt(prompt("Введи число №1")),
	b = parseInt(prompt("Введи число №2")),
) {
	const numBiger = a > b ? a : b;
	const numLower = a < b ? a : b;
	const com = numBiger % numLower;
	if (com === 0) {
		return alert(`НОД - ${numLower}`);
	} else {
		findNod(numLower, com);
	}
}

// 1.5



